<p>Следующие возможности реализованы в текущей стабильной версии jsXe</p>

<h3>Основное</h3>

<ul>
  <li>Написано на Java, поэтому запускается на Mac OS X, OS/2, Unix, VMS и Windows.</li>
  <li>XML-документы редактируются с помощью "отображений". jsXe позволяет
      использовать несколько разных отображений.</li>
  <li>Подсветка синтаксиса в режиме исходника (с версии 0.4 beta).</li>
  <li>Интерфейс плагинов, который позволяет добавлять режимы
      без перекомпиляции.</li>
  <li>Относительно хорошая сериализация XML-документов.
      Поддерживает опциональность форматирования или
      не-форматирования сериализованных документов. Позволяет
      избегать пустот в тексте.</li>
  <li>Позволяет открывать и редактировать несколько XML-документов
      в одном открытом окне (вкладочный интерфейс - табы).</li>
  <li>Возрастающий парсинг. Парсинг и проверка документа будет
      выполнена автоматически без нажатия соответствующей кнопки.</li>
  <li>Поддержка проверки XML-документа с использованием DTD и
      других форм Schema.</li>
  <li>Самопроверка DTD/Schema. Информация в DTD/Schema используется для
      допуска пользователей к возможности добавлять и редактировать
      узлы на основе объявленных в DTD/Schema.</li>
  <li>Интернационализация. jsXe позволяет легко создавать переводы для
      интерфейса программы на ваш родной язык.</li>
  <li>Встроенная подержка дополнения для XML Schema, XHTML, XSLT, и
      XSL:FO.</li>
</ul>

<h3>Отображение деревом</h3>

<ul>
  <li>Добавление, удаление и редактирование узлов в XML-документе с использованием
  контекстных меню.</li>
  <li>Добавление, удаление и редактирование аттрибутов узла.</li>
  <li>Возможность перетаскивания XML-узлов внутри дерева и в текстовые редакторы.</li>
</ul>

<h3>Отображение исходником</h3>

<ul>
  <li>Редактирование текста полного исходника любого XML-документа.</li>
  <li>Вырезание, копирование, вставка и другие ограниченные возможности.</li>
</ul>


<h2>Запланированные возможности</h2>

<p>Эти возможности были добавлены в версию jsXe "в разработке" или были запланированы для будующей реализации</p>

<ul>
  <li>Отображение "schema designer", которое использует <a href="http://www.jgraph.com/">JGraph</a>.</li>
  <li>Отображение "docbook", которое использует <a href="http://vex.sourceforge.net/">Vex</a>.</li>
  <li>Рендерер XHTML, который использует <a href="https://xhtmlrenderer.dev.java.net/">Flying Saucer</a>.</li>
  <li>Поддержка трансформации XML-документов с использованием таблиц стилей XSLT.</li>
  <li>Возможность бесконечного списка действий для отмены (с версии 0.5 beta).</li>
  <li>Дополнение тегов с применением самопроверки DTD/Schema (с версии 0.5 beta).</li>
  <li>Автоматическая вставка закрывающих тегов ( с версии 0.5 beta).</li>
  <li>Справочная система с использованием <a href="http://aurigadoc.sourceforge.net/">AurigaDoc</a> или <a href="http://docbook.sourceforge.net/">Docbook</a> (с версии 0.6 beta)</li>
</ul>
