<p>Проекту jsXe нужны разработчики для реализации новых возможностей и
   охоты за жуками, тестеры для (как это ни странно) тестирования jsXe,
   переводчики для того чтобы переводить сообщения внутри программы и тексты
   на сайте проекта, вебдизайнеры которые заинтересованы в обновлении сайта
   проекта.</p>

<p>Принять участие довольно просто. Существует несколько способов. Наиболее
   простой - подписаться на списки рассылки, однако в вашем распоряжении
   есть несколько методов.</p>

<p>Обратите внимание: участникам проекта требуется указать свои настоящие имена.</p>

<h3>Разработчики</h3>

<p>Если вы заинтересованы в работе над jsXe, просьба
   <a href="#lists">подписаться</a>
   и отправить письмо в список рассылки jsxe-devel. Другие разработчики
   могут помочь вам начать. Разработчику необходимо знать как использовать
   SVN и иметь некоторый опыт в работе с Java или XML.</p>

<h3>Тестеры</h3>

<p>Если вам интересно тестирование jsXe, просьба
   <a href="#lists">подписаться</a>
   и отправить письмо в список рассылки jsxe-devel. Обычно тестируются сборки
   из SVN и бета-релизы.
   done on SVN and beta releases. Знание
   <a href="http://subversion.tigris.org/">SVN</a> и
   <a href="http://ant.apache.org/">ant</a> желательно, поскольку оно потребуется
   для тестирования кода из репозитория SVN.</p>

<h3>Переводчики</h3>

<p>Если вы заинтересованы в переводе jsXe на другие языки, просьба
   <a href="#lists">подписаться</a>
   и отправить письмо в список рассылки jsxe-devel. Для тех кто знаком
   с SVN - вы можете чекаутить message-файлы из
   <a href="http://svn.sourceforge.net/viewcvs.cgi/jsxe/trunk/jsxe/">SVN-репозитория</a>
   jsXe. Но если у вас нет опыта работы с SVN, в списках рассылки
   разработчики могут помочь вам.</p>

<h3>Web-разработчики</h3>

<p>Если вы заинтересованы в работе над страницей jsXe, просьба
   <a href="#lists">подписаться</a>
   и отправить письмо в список рассылки jsxe-devel. Разработчики могут помочь
   вам начать. Вам отребуются знание CSS и PHP.</p>

<h3>Пользователи</h3>

<p>Дайте нас знать что вы думаете о программе!
   <a href="#lists">Подпишитесь</a>
   на список рассылки jsxe-users и присылайте туда ваши предложения о том
   какие возможности вы хотели бы видеть реализованными в новых версиях jsXe.
   Вы также можете добавить новый
   <a href="http://sourceforge.net/tracker/?atid=488271&amp;group_id=58584&amp;func=browse">feature request</a>
   - это предложение о изменении чего-либо в последующих версиях, для каждого feature request
   создается отдельная страница и на ней можно будет отслеживать реакцию разработчиков на
   ваше предложение.</p>

<h3><a name="lists">Списки рассылки</a></h3>

<p>Существует 3 списка рассылки (траффик небольшой).</p>

<ul>
  <li>jsXe-users (English): <a href="http://lists.sourceforge.net/mailman/listinfo/jsxe-users">Subscribe/Unsubscribe/Preferences</a>: основной список рассылки для пользователей jsXe.</li>
  <li>jsXe-devel (English): <a href="http://lists.sourceforge.net/mailman/listinfo/jsxe-devel">Subscribe/Unsubscribe/Preferences</a>: обсуждение технических вопросов о разработке jsXe.</li>
  <li>jsXe-users (日本語): <a href="http://lists.sourceforge.jp/mailman/listinfo/jsxe-users">Subscribe/Unsubscribe/Preferences</a>: основной список рассылки для пользователей jsXe.</li>
  <li>jsXe-cvs: <a href="http://lists.sourceforge.net/mailman/listinfo/jsxe-cvs">Subscribe/Unsubscribe/Preferences</a>: список рассылки, куда отправляются комментарии к коммитам в SVN. Любой подписавшийся будет получать сообщения после внесения изменений в SVN.</li>
</ul>

<h3>Форумы</h3>

<p>Если у вас возникли проблемы с установкой или запуском jsXe, пожалуйста
   оставте сообщение в форум "Help". Все другие комментарии и критика
   могут быть оставлены в форуме "Open Discussion".</p>

<ul>
  <li><a href="http://sourceforge.net/forum/forum.php?forum_id=197160">Open Discussion</a></li>
  <li><a href="http://sourceforge.net/forum/forum.php?forum_id=197161">Help</a></li>
</ul>

<h3>IRC</h3>

<p>Посетите #jsxe на irc.freenode.net чтобы поговорить с разработчиками.</p>

<h3>Если вы нашли ошибку (баг).</h3>

<p>Сообщить о баге просто. Достаточно оставить багрепорт в <a href="http://sourceforge.net/tracker/?atid=488268&amp;group_id=58584&amp;func=browse">в баг-трекере jsXe</a>.
   Оставьте описание ошибки, и если возможно - то способ, которым можно
   эту ошибку специально вызвать. Команда разработчиков получит эту информацию.</p>

<h3>Предложения (Feature Requests)</h3>

<p>Ваши предложения всегда приветствуются и будут приняты в зависимости от
   того насколько это необходимо пользователям, а также на основании того
   насколько предложение укладывается в представления о том каким должен быть
   jsXe. Отправить предложение не сложнее чем сообщение о ошибке.
   Сделать это можно в
   <a href="http://sourceforge.net/tracker/?atid=488271&amp;group_id=58584&amp;func=browse">трекере предложений jsXe</a>.</p>

<h3>Патчи</h3>

<p>Это лучший способ чтобы начать помогать в разработке jsXe.
   Вы можете отправлять патчи с помощью
   <a href="http://sourceforge.net/tracker/?atid=488270&amp;group_id=58584&amp;func=browse">трекера патчей jsXe</a>.
   Просто предоставьте патч или изменение кода + описание того, что ваш патч
   делает и отправьте. Если ваша работа хороша, то мы дадим вам
   доступ разработчика к нашему SVN.</p>
