<p>jsXe расшифровывается как <b>J</b>ava  <b>S</b>imple <b>X</b>ML <b>E</b>ditor. Примерный перевод - простой редактор XML на Java.</p>
<p>jsXe - быстрый, интуитивный, расширяемый, платформо-независимый редактор XML.
   Он написан на <a href="http://java.sun.com">Java</a> с использованием the Swing
   toolkit, и <a href="http://xml.apache.org/xerces2-j/">Xerces-J</a>
   и распространяется на условиях
   <a href="http://www.gnu.org/copyleft/gpl.html">GNU General Public License</a>.
   Его цель - предоставить пользователям и разработчикам интуитивный способ
   создания XML-документов, который достаточно прост для того чтобы иметь дело
   с любым XML-документом, но в тоже время достаточно гибкий для того чтобы
   позволить добавлять подержку форматов XML-документов с помощью плагинов.</p>
<p>jsXe сейчас в стадии beta-версии и множество запланированных возможностей
   еще не реализованы. Если вы интересуетесь возможностью помочь jsXe стать
   отличным редактором внося свои предложения, или же если вы разработчик и
   хотите отдать проекту свое время и код - смотрите сюда:
   <?php echo create_link('get-involved.php', 'how to get involved'); ?>.</p>
